anhvanthe/Nordic-Thingy52-FW/nRF5xSDKv14.2/components/libraries/bootloader/ble_dfu/nrf_ble_dfu.c
#define BLE_OBSERVER_PRIO                   2                                                       /**< BLE observer priority. Controls the priority for BLE event handler. */

DFU_TRANSPORT_REGISTER(nrf_dfu_transport_t const dfu_trans) =
{
    .init_func  = ble_dfu_transport_init,
    .close_func = ble_dfu_transport_close
};

static ble_dfu_t m_dfu;                                                                             /**< Structure used to identify the Device Firmware Update service. */
static uint16_t  m_pkt_notif_target;                                                                /**< Number of packets of firmware data to be received before transmitting the next Packet Receipt Notification to the DFU Controller. */
static uint16_t  m_pkt_notif_target_cnt;                                                            /**< Number of packets of firmware data received after sending last Packet Receipt Notification or since the receipt of a @ref BLE_DFU_PKT_RCPT_NOTIF_ENABLED event from the DFU service, which ever occurs later.*/
static uint16_t  m_conn_handle = BLE_CONN_HANDLE_INVALID;                                           /**< Handle of the current connection. */
static uint32_t  m_flags;
static uint8_t   m_notif_buffer[MAX_RESPONSE_LEN];                                                  /**< Buffer used for sending notifications to peer. */

#if defined(NRF_DFU_BLE_REQUIRES_BONDS) && (NRF_DFU_BLE_REQUIRES_BONDS == 1)
static nrf_dfu_peer_data_t         m_peer_data;
static ble_gap_addr_t      const * m_whitelist[1];                                                  /**< List of peers in whitelist (only one) */
static ble_gap_id_key_t    const * m_gap_ids[1];
#else
static nrf_dfu_adv_name_t          m_adv_name;
#endif


/**@brief     Function for the Advertising functionality initialization.
 *
 * @details   Encodes the required advertising data and passes it to the stack.
 *            The advertising data encoded here is specific for DFU.
 *            Setting advertising data can by done by calling @ref ble_advdata_set.
 */
static uint32_t advertising_init(uint8_t adv_flags)
{
    uint32_t err_code;
    uint16_t len_advdata                = APP_ADV_DATA_HEADER_SIZE;
    uint16_t actual_device_name_length  = BLE_GAP_ADV_MAX_SIZE - APP_ADV_DATA_HEADER_SIZE;
    uint8_t p_encoded_advdata[BLE_GAP_ADV_MAX_SIZE];

    // Encode flags.
    p_encoded_advdata[0] = 0x2;
    p_encoded_advdata[1] = BLE_GAP_AD_TYPE_FLAGS;
    p_encoded_advdata[2] = adv_flags;

    // Encode 'more available' UUID list.
    p_encoded_advdata[3] = 0x3;
    p_encoded_advdata[4] = BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE;
    p_encoded_advdata[5] = LSB_16(BLE_DFU_SERVICE_UUID);
    p_encoded_advdata[6] = MSB_16(BLE_DFU_SERVICE_UUID);

    // Get GAP device name and length.
    err_code = sd_ble_gap_device_name_get(&p_encoded_advdata[9], &actual_device_name_length);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    
    // Set GAP device in advertising data.
    p_encoded_advdata[7] = actual_device_name_length + 1; // (actual_length + ADV_AD_TYPE_FIELD_SIZE(1))
    p_encoded_advdata[8] = BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME;
    len_advdata += actual_device_name_length;

    return sd_ble_gap_adv_data_set(p_encoded_advdata, len_advdata, NULL, 0);
}


/**@brief Function for starting advertising.
 */
static uint32_t advertising_start(void)
{
    uint32_t err_code;
    ble_gap_adv_params_t adv_params =
    {
        .type        = BLE_GAP_ADV_TYPE_ADV_IND,
        .p_peer_addr = NULL,
        .fp          = BLE_GAP_ADV_FP_ANY,
        .interval    = APP_ADV_INTERVAL,
        .timeout     = APP_ADV_TIMEOUT_IN_SECONDS,
    };
    uint8_t  adv_flag = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

#if defined(NRF_DFU_BLE_REQUIRES_BONDS) && (NRF_DFU_BLE_REQUIRES_BONDS == 1)
    ble_gap_irk_t empty_irk = {{0}};

    NRF_LOG_DEBUG("##### Setting adv with peer data ####");
    if (memcmp(m_peer_data.ble_id.id_info.irk, empty_irk.irk, sizeof(ble_gap_irk_t)) == 0)
    {
        NRF_LOG_DEBUG("##### No IRK, General discovery");
    }
    else
    {
        NRF_LOG_DEBUG("##### IRK Found. Setting whitelist ####");

        // API versions lower than 3 are not supported.
        STATIC_ASSERT(NRF_SD_BLE_API_VERSION >= 3);

        m_whitelist[0] = &m_peer_data.ble_id.id_addr_info;
        err_code = sd_ble_gap_whitelist_set(m_whitelist, 1);
        VERIFY_SUCCESS(err_code);

        m_gap_ids[0] = &m_peer_data.ble_id;
        sd_ble_gap_device_identities_set(m_gap_ids, NULL, 1);
        VERIFY_SUCCESS(err_code);

        adv_flag      = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
        adv_params.fp = BLE_GAP_ADV_FP_FILTER_CONNREQ;
    }
#else
    {
        NRF_LOG_DEBUG("#### Advertising NO BONDING ####");
    }
#endif // NRF_DFU_BLE_REQUIRES_BONDS

    err_code = advertising_init(adv_flag);
    VERIFY_SUCCESS(err_code);

    (void) sd_ble_gap_adv_stop();
    err_code = sd_ble_gap_adv_start(&adv_params, APP_BLE_CONN_CFG_TAG);
    VERIFY_SUCCESS(err_code);

    nrf_gpio_pin_clear(ADVERTISING_LED_PIN_NO);
    nrf_gpio_pin_set(CONNECTED_LED_PIN_NO);

    return NRF_SUCCESS;
}


/**@brief Function for stopping advertising.
 */
static void advertising_stop(void)
{
    (void)sd_ble_gap_adv_stop();
    nrf_gpio_pin_set(ADVERTISING_LED_PIN_NO);

}


static bool is_cccd_configured(ble_dfu_t * p_dfu)
{
    uint8_t  cccd_val_buf[BLE_CCCD_VALUE_LEN];
    ble_gatts_value_t gatts_value = {0};

    gatts_value.len     = BLE_CCCD_VALUE_LEN;
    gatts_value.p_value = cccd_val_buf;

    // Check the CCCD Value of DFU Control Point.
    uint32_t err_code = sd_ble_gatts_value_get(m_conn_handle,
                                               p_dfu->dfu_ctrl_pt_handles.cccd_handle,
                                               &gatts_value);
    VERIFY_SUCCESS(err_code);

    return ble_srv_is_notification_enabled(cccd_val_buf);
}


static uint32_t send_hvx(uint16_t conn_handle, uint16_t value_handle, uint16_t len)
{
    ble_gatts_hvx_params_t hvx_params = {0};

    hvx_params.handle = value_handle;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
    hvx_params.p_len  = &len;
    hvx_params.p_data = m_notif_buffer;

    return sd_ble_gatts_hvx(conn_handle, &hvx_params);
}


#if defined(NRF_DFU_BLE_REQUIRES_BONDS) && (NRF_DFU_BLE_REQUIRES_BONDS == 1)
static uint32_t service_changed_send(void)
{
    uint32_t err_code;

